app/Models/AdminModel.php

SELECT *
FROM `user`
---
	function retrive_list_user()
	{
		return $this->db
					->table('user')
					->get()
					->getResult();

SELECT *
FROM `user`
WHERE `IdUser` = '1'
---
	function getDataUserEdit($id)
	{
		$builder = $this->table($this->table);
        $builder->where('IdUser', $id);
        $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `user`
---
	function retrive_list_user_count_user()
	{
		return $this->db
					->table('user')
					->countAllResults();