app/Models/AdminModelComments.php

    public function insertComment($data)
    {
        return $this->db
                    ->table('comments')
                    ->insert($data);
---
INSERT INTO `comments` (`CommentName`, `CommentEmail`, `CommentContent`, `CommentPostId`) VALUES ('Sumbai Distapratama', 'Sumbaidp@gmail.com', 'Sed dignissim a magna vel scelerisque. Vestibulum porta vulputate dignissim. Proin venenatis, ex ut luctus iaculis, elit tortor aliquet mauris, nec ornare mi metus id nulla.', '28')

    function listCommentFront($CommentPostId, $Keywords, $TotalPage,$group_dataset = null)
    {
        $builder = $this->table($this->table);
        $arrKeywords = explode(" ", $Keywords);
        $builder->groupStart();
        for($i=0; $i<count($arrKeywords);$i++)
        {
            $builder->orLike('CommentName', $arrKeywords[$i]);
            $builder->orLike('CommentContent', $arrKeywords[$i]);
        }
        $builder->groupEnd();
        $builder->where('CommentPostId', $CommentPostId);
        $builder->orderBy('CommentPostTime', 'desc');

        $data['record'] = $builder->paginate($TotalPage, $group_dataset);
---
SELECT *
FROM `comments`
WHERE   (
`CommentName` LIKE '%%' ESCAPE '!'
OR  `CommentContent` LIKE '%%' ESCAPE '!'
 )
AND `CommentPostId` = '28'
ORDER BY `CommentPostTime` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `comments`
WHERE   (
`CommentName` LIKE '%%' ESCAPE '!'
OR  `CommentContent` LIKE '%%' ESCAPE '!'
 )
AND `CommentPostId` = '28'